# 課題7

puts "------------------------------"
## 1.1〜100までの数値配列aを用意し、３の倍数のみ取得した配列cを作成し値を出力
a = (1..100).to_a
c = a.delete_if{ |i| i % 3 != 0 }

p c


puts "------------------------------"
## 2.数値配列aと数値配列bの各要素を足し合わせた結果を配列で返すsum_arrayメソッドを作成
def sum_array(a, b)
    c = []
    0.upto(a.length-1) do |i|
       c[i] = a[i] + b[i]
    end
    return c
end
p sum_array([1,2,3], [4,5,6]) 


puts "------------------------------"
## 3.重複データを排除して出力
list = [1, 2, 3, 1, 2, 1, 2, 6, 5 , "c", "ruby", "c"]

p list.uniq


puts "------------------------------"
## 4.重複データを排除して出力
list = [5, 6, 1, 3, 4]

p list.sort
puts "------------------------------"