# 課題9
## 正規表現

puts "------------------------------------------------------------"
### ユーザ名
until %r!^@[A-Z]{3,}! do
    puts "ユーザ名を入力してください(先頭@の大文字3文字以上)"
    user = gets

    unless %r!^@!=~user then
        puts "[invalid]: 先頭@を入力してください"
    end
    unless %r![A-Z]{3,}!=~user then
        puts "[invalid]: 大文字3文字以上で入力してください"
    end
    puts "------------------------------------------------------------"
end

### 電話番号
until %r!^0(\d{2}-?\d{4}-?\d{4}|\d{3}-?\d{3}-?\d{3}|\d{2}-?\d{3}-?\d{4})$! do
    puts "電話番号を入力してください(ハイフン入れてください)"
    tel = gets

    unless %r!^0(\d{2}-?\d{4}-?\d{4}|\d{3}-?\d{3}-?\d{3}|\d{2}-?\d{3}-?\d{4})!=~tel then
        puts "invalid: 電話番号が不正です"
    end
    puts "------------------------------------------------------------"
end

### 郵便番号
until %r!^\d{3}-?\d{4}$! do
    puts "郵便番号を入力してください"
    post = gets

    unless %r!\d{3}-?\d{4}$!=~post then
        puts "郵便番号が不正です"
    end
    puts "------------------------------------------------------------"
end

### メールアドレス
until %r!^[0-9a-zA-Z\-\_\.]+@[0-9a-zA-Z\-\_\.]+! do
    puts "メールアドレスを入力してください"
    email = gets

    unless %r!^[0-9a-zA-Z\-\_\.]+@[0-9a-zA-Z\-\_\.]+!=~email then
        puts "メールアドレスが不正です"
    end
    puts "------------------------------------------------------------"
end

puts "complete"
print "ユーザ名: ", user, "\n"
print "電話番号: ", tel, "\n"
print "郵便番号: ", post, "\n"
print "メールアドレス: ", email, "\n"

puts "------------------------------------------------------------"
